10/data/attachments/f8242729c1b243ce.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Amanda_owner_Friend_51282_8</nif:username>
            <nif:friendToBeRequested>soap_friends_93ff4070-cf5c-40b5-82d5-9452476aa2ca</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>